---
kind: type
id: T:Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData
source: html/7cfa05c3-a2b8-5bb9-bec3-5a0c61f0ca27.htm
---
# Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData

The input and output data used by external UI servers for storing UI settings.

## Syntax (C#)
```csharp
public class DuctFittingAndAccessoryPressureDropUIData : IDisposable
```